lecture-note/ai-lecture-kdh-200908-2.org
#+title: 머신러닝용 학습용 데이터셋 예제 연습
#+subtitle: 4 weeks by kdh
#+date: <2020-09-08 Tue 18:00>
#+tags: python, bash, elisp, lisp, zoom
#+author: srolisp

* Iris
아이리스는 3가지 종류가 있는데 4가지 속성값을 이용해서 이를 구분해보는 예제 (클래스로 분류를 하게 하는 예제)
 :PROPERTIES:
 :header-args:bash: :results verbatim
 :header-args:elisp: :exports both
 :header-args:ipython: :session iris :exports both
 :END:
** 사이킷런 데이터셋에서 아이리스 데이터셋을 임포트한다.
#+begin_src ipython :tangle "test2.py"
  from sklearn.datasets import load_iris
#+end_src

#+RESULTS:
: # Out[3]:

** 데이터프레임을 이용하기 위해 pandas를 임포트한다.
#+begin_src ipython :tangle "test2.py"
import pandas as pd
#+end_src

#+RESULTS:
: # Out[4]:

** 아이리스 데이터셋을 로드하여 iris에 담는다.
#+begin_src ipython :results output :tangle "test2.py"
iris = load_iris()
#+end_src

#+RESULTS:

