lecture-note/ai-lecture-kdh-200908-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-08 Tue 19:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Iris</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="srolisp" />
</head>
<body>
<div id="content">
<h1 class="title">Iris
<br />
<span class="subtitle">4 weeks by kdh</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9eae24b">1. 아이리스는 3가지 종류가 있는데 4가지 속성값을 이용해서 이를 구분해보는 예제</a>
<ul>
<li><a href="#org2d35c12">1.1. 사이킷런 데이터셋에서 아이리스 데이터셋을 임포트한다.</a></li>
<li><a href="#orge0ecde1">1.2. 데이터프레임을 이용하기 위해 pandas를 임포트한다.</a></li>
<li><a href="#org8a84a15">1.3. 아이리스 데이터셋을 로드하여 iris에 담는다.</a></li>
<li><a href="#orgc758b62">1.4. 아이리스 데이터셋을 출력한다.</a></li>
<li><a href="#org8e5279f">1.5. 키값들을 출력한다.</a></li>
<li><a href="#orga0876cc">1.6. 데이터셋의 설명 내용을 출력한다.</a></li>
<li><a href="#org8edf53d">1.7. 데이터셋의 특성 이름들을 출력한다.</a></li>
<li><a href="#orgd3f42f8">1.8. 데이터셋의 데이터값을 특성이름을 이용하여 데이터프레임을 만든다.</a></li>
<li><a href="#org09863ee">1.9. 데이터셋의 타겟값을 데이터프레임에 넣는다.</a></li>
<li><a href="#orgdd2400f">1.10. 데이터프레임의 처음 5개를 출력한다.</a></li>
<li><a href="#orgff40eae">1.11. 데이터프레임의 마지막 5개를 출력한다.</a></li>
<li><a href="#orgd0a81f8">1.12. 데이터프레임의 모양을 출력한다.</a></li>
<li><a href="#org5d87437">1.13. 데이터프레임의 기본통꼐 정보를 출력한다.</a></li>
<li><a href="#orga8cbee7">1.14. 데이터프레임의 마지막 컬럼값을 카운트하여 출력한다.</a></li>
<li><a href="#org5f5c955">1.15. 데이터프레임의 target 컬럼값을 카운트하여 출력한다. 마지막 칼럼이니 같은 값이 나오겠지?</a></li>
<li><a href="#org39cc178">1.16. 테이터값을 X<sub>data에</sub> 할당한다.</a></li>
<li><a href="#org75edc92">1.17. 타겟값을 y<sub>data에</sub> 할당한다.</a></li>
<li><a href="#org02b9cc8">1.18. X<sub>data을</sub> 출력한다.</a></li>
<li><a href="#org74d6a6a">1.19. y<sub>data을</sub> 출력한다.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9eae24b" class="outline-2">
<h2 id="org9eae24b"><span class="section-number-2">1</span> 아이리스는 3가지 종류가 있는데 4가지 속성값을 이용해서 이를 구분해보는 예제</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2d35c12" class="outline-3">
<h3 id="org2d35c12"><span class="section-number-3">1.1</span> 사이킷런 데이터셋에서 아이리스 데이터셋을 임포트한다.</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-ipython">from sklearn.datasets import load_iris
</pre>
</div>

<pre class="example">
# Out[28]:
</pre>
</div>
</div>

<div id="outline-container-orge0ecde1" class="outline-3">
<h3 id="orge0ecde1"><span class="section-number-3">1.2</span> 데이터프레임을 이용하기 위해 pandas를 임포트한다.</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-ipython">import pandas as pd
</pre>
</div>

<pre class="example">
# Out[29]:
</pre>
</div>
</div>

<div id="outline-container-org8a84a15" class="outline-3">
<h3 id="org8a84a15"><span class="section-number-3">1.3</span> 아이리스 데이터셋을 로드하여 iris에 담는다.</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-ipython">iris = load_iris()
</pre>
</div>
</div>
</div>
