lecture-note/ai-lecture-kdh-200908-2.org
** 키값들을 출력한다.
#+begin_src ipython :results output :tangle "test2.py"
print(iris.keys())
#+end_src

#+RESULTS:
: dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename'])

** 데이터셋의 설명 내용을 출력한다.
#+begin_src ipython :results output :tangle "test2.py"
print(iris.DESCR)
#+end_src

#+RESULTS:
#+begin_example
.. _iris_dataset:

Iris plants dataset
--------------------

,**Data Set Characteristics:**

    :Number of Instances: 150 (50 in each of three classes)
    :Number of Attributes: 4 numeric, predictive attributes and the class
    :Attribute Information:
        - sepal length in cm
        - sepal width in cm
        - petal length in cm
        - petal width in cm
        - class:
                - Iris-Setosa
                - Iris-Versicolour
                - Iris-Virginica
                
    :Summary Statistics:

    ============== ==== ==== ======= ===== ====================
                    Min  Max   Mean    SD   Class Correlation
    ============== ==== ==== ======= ===== ====================
    sepal length:   4.3  7.9   5.84   0.83    0.7826
    sepal width:    2.0  4.4   3.05   0.43   -0.4194
    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)
    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)
    ============== ==== ==== ======= ===== ====================

    :Missing Attribute Values: None
    :Class Distribution: 33.3% for each of 3 classes.
    :Creator: R.A. Fisher
    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)
    :Date: July, 1988

The famous Iris database, first used by Sir R.A. Fisher. The dataset is taken
from Fisher's paper. Note that it's the same as in R, but not as in the UCI
Machine Learning Repository, which has two wrong data points.

This is perhaps the best known database to be found in the
pattern recognition literature.  Fisher's paper is a classic in the field and
is referenced frequently to this day.  (See Duda & Hart, for example.)  The
data set contains 3 classes of 50 instances each, where each class refers to a
type of iris plant.  One class is linearly separable from the other 2; the
latter are NOT linearly separable from each other.

.. topic:: References

   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"
     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to
     Mathematical Statistics" (John Wiley, NY, 1950).
   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.
     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.
   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System
     Structure and Classification Rule for Recognition in Partially Exposed
     Environments".  IEEE Transactions on Pattern Analysis and Machine
     Intelligence, Vol. PAMI-2, No. 1, 67-71.
   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions
     on Information Theory, May 1972, 431-433.
   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II
     conceptual clustering system finds 3 classes in the data.
   - Many, many more ...
#+end_example

** 데이터셋의 특성 이름들을 출력한다.
#+begin_src ipython :results output :tangle "test2.py"
print(iris.feature_names)
#+end_src

#+RESULTS:
: ['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)', 'petal width (cm)']

** 데이터셋의 데이터값을 특성이름을 이용하여 데이터프레임을 만든다.
#+begin_src ipython :results values :tangle "test2.py"
df = pd.DataFrame(iris.data, columns=iris.feature_names)
df
#+end_src

#+RESULTS:
#+begin_example
# Out[10]:
,#+BEGIN_EXAMPLE
  sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
  0                  5.1               3.5                1.4               0.2
  1                  4.9               3.0                1.4               0.2
  2                  4.7               3.2                1.3               0.2
  3                  4.6               3.1                1.5               0.2
  4                  5.0               3.6                1.4               0.2
  ..                 ...               ...                ...               ...
  145                6.7               3.0                5.2               2.3
  146                6.3               2.5                5.0               1.9
  147                6.5               3.0                5.2               2.0
  148                6.2               3.4                5.4               2.3
  149                5.9               3.0                5.1               1.8
  
  [150 rows x 4 columns]
,#+END_EXAMPLE
#+end_example

** 데이터셋의 타겟값을 데이터프레임에 넣는다.
#+begin_src ipython :results values :tangle "test2.py"
df['target'] = iris.target
df['target']
#+end_src

#+RESULTS:
#+begin_example
# Out[11]:
,#+BEGIN_EXAMPLE
  0      0
  1      0
  2      0
  3      0
  4      0
  ..
  145    2
  146    2
  147    2
  148    2
  149    2
  Name: target, Length: 150, dtype: int64
,#+END_EXAMPLE
#+end_example

** 데이터프레임의 처음 5개를 출력한다.
#+begin_src ipython :results values :tangle "test2.py"
df.head()
#+end_src

#+RESULTS:
#+begin_example
# Out[12]:
,#+BEGIN_EXAMPLE
  sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)  \
  0                5.1               3.5                1.4               0.2
  1                4.9               3.0                1.4               0.2
  2                4.7               3.2                1.3               0.2
  3                4.6               3.1                1.5               0.2
  4                5.0               3.6                1.4               0.2
  
  target
  0       0
  1       0
  2       0
  3       0
  4       0
,#+END_EXAMPLE
#+end_example

** 데이터프레임의 마지막 5개를 출력한다.
#+begin_src ipython :results values :tangle "test2.py"
df.tail()
#+end_src

#+RESULTS:
#+begin_example
# Out[13]:
,#+BEGIN_EXAMPLE
  sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)  \
  145                6.7               3.0                5.2               2.3
  146                6.3               2.5                5.0               1.9
  147                6.5               3.0                5.2               2.0
  148                6.2               3.4                5.4               2.3
  149                5.9               3.0                5.1               1.8
  
  target
  145       2
  146       2
  147       2
  148       2
  149       2
,#+END_EXAMPLE
#+end_example

** 데이터프레임의 모양을 출력한다.
#+begin_src ipython :results values :tangle "test2.py"
df.shape
#+end_src

#+RESULTS:
: # Out[19]:
: : (150, 5)

