lecture-note/ai-lecture-kdh-200908-2.org
** 데이터프레임의 기본통꼐 정보를 출력한다.
#+begin_src ipython :results values :tangle "test2.py"
df.describe()
#+end_src

#+RESULTS:
#+begin_example
# Out[20]:
,#+BEGIN_EXAMPLE
  sepal length (cm)  sepal width (cm)  petal length (cm)  \
  count         150.000000        150.000000         150.000000
  mean            5.843333          3.057333           3.758000
  std             0.828066          0.435866           1.765298
  min             4.300000          2.000000           1.000000
  25%             5.100000          2.800000           1.600000
  50%             5.800000          3.000000           4.350000
  75%             6.400000          3.300000           5.100000
  max             7.900000          4.400000           6.900000
  
  petal width (cm)      target
  count        150.000000  150.000000
  mean           1.199333    1.000000
  std            0.762238    0.819232
  min            0.100000    0.000000
  25%            0.300000    0.000000
  50%            1.300000    1.000000
  75%            1.800000    2.000000
  max            2.500000    2.000000
,#+END_EXAMPLE
#+end_example

** 데이터프레임의 마지막 컬럼값을 카운트하여 출력한다.
#+begin_src ipython :results values :tangle "test2.py"
df.iloc[:,-1].value_counts()
#+end_src

#+RESULTS:
: # Out[22]:
: #+BEGIN_EXAMPLE
:   2    50
:   1    50
:   0    50
:   Name: target, dtype: int64
: #+END_EXAMPLE

** 데이터프레임의 target 컬럼값을 카운트하여 출력한다. 마지막 칼럼이니 같은 값이 나오겠지?
#+begin_src ipython :results values :tangle "test2.py"
df.target.value_counts()
#+end_src

#+RESULTS:
: # Out[23]:
: #+BEGIN_EXAMPLE
:   2    50
:   1    50
:   0    50
:   Name: target, dtype: int64
: #+END_EXAMPLE

** 테이터값을 X_data에 할당한다.
#+begin_src ipython :results values :tangle "test2.py"
X_data = iris.data
#+end_src

#+RESULTS:
: # Out[24]:

** 타겟값을 y_data에 할당한다.
#+begin_src ipython :results values :tangle "test2.py"
y_data = iris.target
#+end_src

#+RESULTS:
: # Out[25]:

** X_data을 출력한다.
#+begin_src ipython :results values :tangle "test2.py"
X_data
#+end_src

#+RESULTS:
#+begin_example
# Out[26]:
,#+BEGIN_EXAMPLE
  array([[5.1, 3.5, 1.4, 0.2],
  [4.9, 3. , 1.4, 0.2],
  [4.7, 3.2, 1.3, 0.2],
  [4.6, 3.1, 1.5, 0.2],
  [5. , 3.6, 1.4, 0.2],
  [5.4, 3.9, 1.7, 0.4],
  [4.6, 3.4, 1.4, 0.3],
  [5. , 3.4, 1.5, 0.2],
  [4.4, 2.9, 1.4, 0.2],
  [4.9, 3.1, 1.5, 0.1],
  [5.4, 3.7, 1.5, 0.2],
  [4.8, 3.4, 1.6, 0.2],
  [4.8, 3. , 1.4, 0.1],
  [4.3, 3. , 1.1, 0.1],
  [5.8, 4. , 1.2, 0.2],
  [5.7, 4.4, 1.5, 0.4],
  [5.4, 3.9, 1.3, 0.4],
  [5.1, 3.5, 1.4, 0.3],
  [5.7, 3.8, 1.7, 0.3],
  [5.1, 3.8, 1.5, 0.3],
  [5.4, 3.4, 1.7, 0.2],
  [5.1, 3.7, 1.5, 0.4],
  [4.6, 3.6, 1. , 0.2],
  [5.1, 3.3, 1.7, 0.5],
  [4.8, 3.4, 1.9, 0.2],
  [5. , 3. , 1.6, 0.2],
  [5. , 3.4, 1.6, 0.4],
  [5.2, 3.5, 1.5, 0.2],
  [5.2, 3.4, 1.4, 0.2],
  [4.7, 3.2, 1.6, 0.2],
  [4.8, 3.1, 1.6, 0.2],
  [5.4, 3.4, 1.5, 0.4],
  [5.2, 4.1, 1.5, 0.1],
  [5.5, 4.2, 1.4, 0.2],
  [4.9, 3.1, 1.5, 0.2],
  [5. , 3.2, 1.2, 0.2],
  [5.5, 3.5, 1.3, 0.2],
  [4.9, 3.6, 1.4, 0.1],
  [4.4, 3. , 1.3, 0.2],
  [5.1, 3.4, 1.5, 0.2],
  [5. , 3.5, 1.3, 0.3],
  [4.5, 2.3, 1.3, 0.3],
  [4.4, 3.2, 1.3, 0.2],
  [5. , 3.5, 1.6, 0.6],
  [5.1, 3.8, 1.9, 0.4],
  [4.8, 3. , 1.4, 0.3],
  [5.1, 3.8, 1.6, 0.2],
  [4.6, 3.2, 1.4, 0.2],
  [5.3, 3.7, 1.5, 0.2],
  [5. , 3.3, 1.4, 0.2],
  [7. , 3.2, 4.7, 1.4],
  [6.4, 3.2, 4.5, 1.5],
  [6.9, 3.1, 4.9, 1.5],
  [5.5, 2.3, 4. , 1.3],
  [6.5, 2.8, 4.6, 1.5],
  [5.7, 2.8, 4.5, 1.3],
  [6.3, 3.3, 4.7, 1.6],
  [4.9, 2.4, 3.3, 1. ],
  [6.6, 2.9, 4.6, 1.3],
  [5.2, 2.7, 3.9, 1.4],
  [5. , 2. , 3.5, 1. ],
  [5.9, 3. , 4.2, 1.5],
  [6. , 2.2, 4. , 1. ],
  [6.1, 2.9, 4.7, 1.4],
  [5.6, 2.9, 3.6, 1.3],
  [6.7, 3.1, 4.4, 1.4],
  [5.6, 3. , 4.5, 1.5],
  [5.8, 2.7, 4.1, 1. ],
  [6.2, 2.2, 4.5, 1.5],
  [5.6, 2.5, 3.9, 1.1],
  [5.9, 3.2, 4.8, 1.8],
  [6.1, 2.8, 4. , 1.3],
  [6.3, 2.5, 4.9, 1.5],
  [6.1, 2.8, 4.7, 1.2],
  [6.4, 2.9, 4.3, 1.3],
  [6.6, 3. , 4.4, 1.4],
  [6.8, 2.8, 4.8, 1.4],
  [6.7, 3. , 5. , 1.7],
  [6. , 2.9, 4.5, 1.5],
  [5.7, 2.6, 3.5, 1. ],
  [5.5, 2.4, 3.8, 1.1],
  [5.5, 2.4, 3.7, 1. ],
  [5.8, 2.7, 3.9, 1.2],
  [6. , 2.7, 5.1, 1.6],
  [5.4, 3. , 4.5, 1.5],
  [6. , 3.4, 4.5, 1.6],
  [6.7, 3.1, 4.7, 1.5],
  [6.3, 2.3, 4.4, 1.3],
  [5.6, 3. , 4.1, 1.3],
  [5.5, 2.5, 4. , 1.3],
  [5.5, 2.6, 4.4, 1.2],
  [6.1, 3. , 4.6, 1.4],
  [5.8, 2.6, 4. , 1.2],
  [5. , 2.3, 3.3, 1. ],
  [5.6, 2.7, 4.2, 1.3],
  [5.7, 3. , 4.2, 1.2],
  [5.7, 2.9, 4.2, 1.3],
  [6.2, 2.9, 4.3, 1.3],
  [5.1, 2.5, 3. , 1.1],
  [5.7, 2.8, 4.1, 1.3],
  [6.3, 3.3, 6. , 2.5],
  [5.8, 2.7, 5.1, 1.9],
  [7.1, 3. , 5.9, 2.1],
  [6.3, 2.9, 5.6, 1.8],
  [6.5, 3. , 5.8, 2.2],
  [7.6, 3. , 6.6, 2.1],
  [4.9, 2.5, 4.5, 1.7],
  [7.3, 2.9, 6.3, 1.8],
  [6.7, 2.5, 5.8, 1.8],
  [7.2, 3.6, 6.1, 2.5],
  [6.5, 3.2, 5.1, 2. ],
  [6.4, 2.7, 5.3, 1.9],
  [6.8, 3. , 5.5, 2.1],
  [5.7, 2.5, 5. , 2. ],
  [5.8, 2.8, 5.1, 2.4],
  [6.4, 3.2, 5.3, 2.3],
  [6.5, 3. , 5.5, 1.8],
  [7.7, 3.8, 6.7, 2.2],
  [7.7, 2.6, 6.9, 2.3],
  [6. , 2.2, 5. , 1.5],
  [6.9, 3.2, 5.7, 2.3],
  [5.6, 2.8, 4.9, 2. ],
  [7.7, 2.8, 6.7, 2. ],
  [6.3, 2.7, 4.9, 1.8],
  [6.7, 3.3, 5.7, 2.1],
  [7.2, 3.2, 6. , 1.8],
  [6.2, 2.8, 4.8, 1.8],
  [6.1, 3. , 4.9, 1.8],
  [6.4, 2.8, 5.6, 2.1],
  [7.2, 3. , 5.8, 1.6],
  [7.4, 2.8, 6.1, 1.9],
  [7.9, 3.8, 6.4, 2. ],
  [6.4, 2.8, 5.6, 2.2],
  [6.3, 2.8, 5.1, 1.5],
  [6.1, 2.6, 5.6, 1.4],
  [7.7, 3. , 6.1, 2.3],
  [6.3, 3.4, 5.6, 2.4],
  [6.4, 3.1, 5.5, 1.8],
  [6. , 3. , 4.8, 1.8],
  [6.9, 3.1, 5.4, 2.1],
  [6.7, 3.1, 5.6, 2.4],
  [6.9, 3.1, 5.1, 2.3],
  [5.8, 2.7, 5.1, 1.9],
  [6.8, 3.2, 5.9, 2.3],
  [6.7, 3.3, 5.7, 2.5],
  [6.7, 3. , 5.2, 2.3],
  [6.3, 2.5, 5. , 1.9],
  [6.5, 3. , 5.2, 2. ],
  [6.2, 3.4, 5.4, 2.3],
  [5.9, 3. , 5.1, 1.8]])
,#+END_EXAMPLE
#+end_example

** y_data을 출력한다.
#+begin_src ipython :results values :tangle "test2.py"
y_data
#+end_src

#+RESULTS:
#+begin_example
# Out[27]:
,#+BEGIN_EXAMPLE
  array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
  1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
  1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
  2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
  2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])
,#+END_EXAMPLE
#+end_example
