lecture-note/ai-lecture-kdh-200908-2.html
# Out[39]:
: (150, 5)
</pre>
</div>
</div>

<div id="outline-container-org5d87437" class="outline-3">
<h3 id="org5d87437"><span class="section-number-3">1.13</span> 데이터프레임의 기본통꼐 정보를 출력한다.</h3>
<div class="outline-text-3" id="text-1-13">
<div class="org-src-container">
<pre class="src src-ipython">df.describe()
</pre>
</div>

<pre class="example">
# Out[40]:
#+BEGIN_EXAMPLE
  sepal length (cm)  sepal width (cm)  petal length (cm)  \
  count         150.000000        150.000000         150.000000
  mean            5.843333          3.057333           3.758000
  std             0.828066          0.435866           1.765298
  min             4.300000          2.000000           1.000000
  25%             5.100000          2.800000           1.600000
  50%             5.800000          3.000000           4.350000
  75%             6.400000          3.300000           5.100000
  max             7.900000          4.400000           6.900000
  
  petal width (cm)      target
  count        150.000000  150.000000
  mean           1.199333    1.000000
  std            0.762238    0.819232
  min            0.100000    0.000000
  25%            0.300000    0.000000
  50%            1.300000    1.000000
  75%            1.800000    2.000000
  max            2.500000    2.000000
#+END_EXAMPLE
</pre>
</div>
</div>

<div id="outline-container-orga8cbee7" class="outline-3">
<h3 id="orga8cbee7"><span class="section-number-3">1.14</span> 데이터프레임의 마지막 컬럼값을 카운트하여 출력한다.</h3>
<div class="outline-text-3" id="text-1-14">
<div class="org-src-container">
<pre class="src src-ipython">df.iloc[:,-1].value_counts()
</pre>
</div>

<pre class="example">
# Out[41]:
#+BEGIN_EXAMPLE
  2    50
  1    50
  0    50
  Name: target, dtype: int64
#+END_EXAMPLE
</pre>
</div>
</div>

<div id="outline-container-org5f5c955" class="outline-3">
<h3 id="org5f5c955"><span class="section-number-3">1.15</span> 데이터프레임의 target 컬럼값을 카운트하여 출력한다. 마지막 칼럼이니 같은 값이 나오겠지?</h3>
<div class="outline-text-3" id="text-1-15">
<div class="org-src-container">
<pre class="src src-ipython">df.target.value_counts()
</pre>
</div>

<pre class="example">
# Out[42]:
#+BEGIN_EXAMPLE
  2    50
  1    50
  0    50
  Name: target, dtype: int64
#+END_EXAMPLE
</pre>
</div>
</div>

<div id="outline-container-org39cc178" class="outline-3">
<h3 id="org39cc178"><span class="section-number-3">1.16</span> 테이터값을 X<sub>data에</sub> 할당한다.</h3>
<div class="outline-text-3" id="text-1-16">
<div class="org-src-container">
<pre class="src src-ipython">X_data = iris.data
</pre>
</div>

<pre class="example">
# Out[43]:
</pre>
</div>
</div>

<div id="outline-container-org75edc92" class="outline-3">
<h3 id="org75edc92"><span class="section-number-3">1.17</span> 타겟값을 y<sub>data에</sub> 할당한다.</h3>
<div class="outline-text-3" id="text-1-17">
<div class="org-src-container">
<pre class="src src-ipython">y_data = iris.target
</pre>
</div>

<pre class="example">
# Out[44]:
</pre>
</div>
</div>

<div id="outline-container-org02b9cc8" class="outline-3">
<h3 id="org02b9cc8"><span class="section-number-3">1.18</span> X<sub>data을</sub> 출력한다.</h3>
<div class="outline-text-3" id="text-1-18">
<div class="org-src-container">
<pre class="src src-ipython">X_data
</pre>
</div>

<pre class="example">
# Out[45]:
#+BEGIN_EXAMPLE
  array([[5.1, 3.5, 1.4, 0.2],
  [4.9, 3. , 1.4, 0.2],
  [4.7, 3.2, 1.3, 0.2],
  [4.6, 3.1, 1.5, 0.2],
  [5. , 3.6, 1.4, 0.2],
  [5.4, 3.9, 1.7, 0.4],
  [4.6, 3.4, 1.4, 0.3],
  [5. , 3.4, 1.5, 0.2],
  [4.4, 2.9, 1.4, 0.2],
  [4.9, 3.1, 1.5, 0.1],
  [5.4, 3.7, 1.5, 0.2],
  [4.8, 3.4, 1.6, 0.2],
  [4.8, 3. , 1.4, 0.1],
  [4.3, 3. , 1.1, 0.1],
  [5.8, 4. , 1.2, 0.2],
  [5.7, 4.4, 1.5, 0.4],
  [5.4, 3.9, 1.3, 0.4],
  [5.1, 3.5, 1.4, 0.3],
  [5.7, 3.8, 1.7, 0.3],
  [5.1, 3.8, 1.5, 0.3],
  [5.4, 3.4, 1.7, 0.2],
  [5.1, 3.7, 1.5, 0.4],
  [4.6, 3.6, 1. , 0.2],
  [5.1, 3.3, 1.7, 0.5],
  [4.8, 3.4, 1.9, 0.2],
  [5. , 3. , 1.6, 0.2],
  [5. , 3.4, 1.6, 0.4],
  [5.2, 3.5, 1.5, 0.2],
  [5.2, 3.4, 1.4, 0.2],
  [4.7, 3.2, 1.6, 0.2],
  [4.8, 3.1, 1.6, 0.2],
  [5.4, 3.4, 1.5, 0.4],
  [5.2, 4.1, 1.5, 0.1],
  [5.5, 4.2, 1.4, 0.2],
  [4.9, 3.1, 1.5, 0.2],
  [5. , 3.2, 1.2, 0.2],
  [5.5, 3.5, 1.3, 0.2],
  [4.9, 3.6, 1.4, 0.1],
  [4.4, 3. , 1.3, 0.2],
  [5.1, 3.4, 1.5, 0.2],
  [5. , 3.5, 1.3, 0.3],
  [4.5, 2.3, 1.3, 0.3],
  [4.4, 3.2, 1.3, 0.2],
  [5. , 3.5, 1.6, 0.6],
  [5.1, 3.8, 1.9, 0.4],
  [4.8, 3. , 1.4, 0.3],
  [5.1, 3.8, 1.6, 0.2],
  [4.6, 3.2, 1.4, 0.2],
  [5.3, 3.7, 1.5, 0.2],
  [5. , 3.3, 1.4, 0.2],
  [7. , 3.2, 4.7, 1.4],
  [6.4, 3.2, 4.5, 1.5],
  [6.9, 3.1, 4.9, 1.5],
  [5.5, 2.3, 4. , 1.3],
  [6.5, 2.8, 4.6, 1.5],
  [5.7, 2.8, 4.5, 1.3],
  [6.3, 3.3, 4.7, 1.6],
  [4.9, 2.4, 3.3, 1. ],
  [6.6, 2.9, 4.6, 1.3],
  [5.2, 2.7, 3.9, 1.4],
  [5. , 2. , 3.5, 1. ],
  [5.9, 3. , 4.2, 1.5],
  [6. , 2.2, 4. , 1. ],
  [6.1, 2.9, 4.7, 1.4],
  [5.6, 2.9, 3.6, 1.3],
  [6.7, 3.1, 4.4, 1.4],
  [5.6, 3. , 4.5, 1.5],
  [5.8, 2.7, 4.1, 1. ],
  [6.2, 2.2, 4.5, 1.5],
  [5.6, 2.5, 3.9, 1.1],
  [5.9, 3.2, 4.8, 1.8],
  [6.1, 2.8, 4. , 1.3],
  [6.3, 2.5, 4.9, 1.5],
  [6.1, 2.8, 4.7, 1.2],
  [6.4, 2.9, 4.3, 1.3],
  [6.6, 3. , 4.4, 1.4],
  [6.8, 2.8, 4.8, 1.4],
  [6.7, 3. , 5. , 1.7],
  [6. , 2.9, 4.5, 1.5],
  [5.7, 2.6, 3.5, 1. ],
  [5.5, 2.4, 3.8, 1.1],
  [5.5, 2.4, 3.7, 1. ],
  [5.8, 2.7, 3.9, 1.2],
  [6. , 2.7, 5.1, 1.6],
  [5.4, 3. , 4.5, 1.5],
  [6. , 3.4, 4.5, 1.6],
  [6.7, 3.1, 4.7, 1.5],
  [6.3, 2.3, 4.4, 1.3],
  [5.6, 3. , 4.1, 1.3],
  [5.5, 2.5, 4. , 1.3],
  [5.5, 2.6, 4.4, 1.2],
  [6.1, 3. , 4.6, 1.4],
  [5.8, 2.6, 4. , 1.2],
  [5. , 2.3, 3.3, 1. ],
  [5.6, 2.7, 4.2, 1.3],
  [5.7, 3. , 4.2, 1.2],
  [5.7, 2.9, 4.2, 1.3],
  [6.2, 2.9, 4.3, 1.3],
  [5.1, 2.5, 3. , 1.1],
  [5.7, 2.8, 4.1, 1.3],
  [6.3, 3.3, 6. , 2.5],
  [5.8, 2.7, 5.1, 1.9],
  [7.1, 3. , 5.9, 2.1],
  [6.3, 2.9, 5.6, 1.8],
  [6.5, 3. , 5.8, 2.2],
  [7.6, 3. , 6.6, 2.1],
  [4.9, 2.5, 4.5, 1.7],
  [7.3, 2.9, 6.3, 1.8],
  [6.7, 2.5, 5.8, 1.8],
  [7.2, 3.6, 6.1, 2.5],
  [6.5, 3.2, 5.1, 2. ],
  [6.4, 2.7, 5.3, 1.9],
  [6.8, 3. , 5.5, 2.1],
  [5.7, 2.5, 5. , 2. ],
  [5.8, 2.8, 5.1, 2.4],
  [6.4, 3.2, 5.3, 2.3],
  [6.5, 3. , 5.5, 1.8],
  [7.7, 3.8, 6.7, 2.2],
  [7.7, 2.6, 6.9, 2.3],
  [6. , 2.2, 5. , 1.5],
  [6.9, 3.2, 5.7, 2.3],
  [5.6, 2.8, 4.9, 2. ],
  [7.7, 2.8, 6.7, 2. ],
  [6.3, 2.7, 4.9, 1.8],
  [6.7, 3.3, 5.7, 2.1],
  [7.2, 3.2, 6. , 1.8],
  [6.2, 2.8, 4.8, 1.8],
  [6.1, 3. , 4.9, 1.8],
  [6.4, 2.8, 5.6, 2.1],
  [7.2, 3. , 5.8, 1.6],
  [7.4, 2.8, 6.1, 1.9],
  [7.9, 3.8, 6.4, 2. ],
  [6.4, 2.8, 5.6, 2.2],
  [6.3, 2.8, 5.1, 1.5],
  [6.1, 2.6, 5.6, 1.4],
  [7.7, 3. , 6.1, 2.3],
  [6.3, 3.4, 5.6, 2.4],
  [6.4, 3.1, 5.5, 1.8],
  [6. , 3. , 4.8, 1.8],
  [6.9, 3.1, 5.4, 2.1],
  [6.7, 3.1, 5.6, 2.4],
  [6.9, 3.1, 5.1, 2.3],
  [5.8, 2.7, 5.1, 1.9],
  [6.8, 3.2, 5.9, 2.3],
  [6.7, 3.3, 5.7, 2.5],
  [6.7, 3. , 5.2, 2.3],
  [6.3, 2.5, 5. , 1.9],
  [6.5, 3. , 5.2, 2. ],
  [6.2, 3.4, 5.4, 2.3],
  [5.9, 3. , 5.1, 1.8]])
#+END_EXAMPLE
</pre>
</div>
</div>

<div id="outline-container-org74d6a6a" class="outline-3">
<h3 id="org74d6a6a"><span class="section-number-3">1.19</span> y<sub>data을</sub> 출력한다.</h3>
<div class="outline-text-3" id="text-1-19">
<div class="org-src-container">
<pre class="src src-ipython">y_data
</pre>
</div>

<pre class="example">
# Out[46]:
#+BEGIN_EXAMPLE
  array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
  1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
  1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
  2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
  2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])
#+END_EXAMPLE
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-09-08 Tue 18:00</p>
<p class="author">Author: srolisp</p>
<p class="date">Created: 2020-09-08 Tue 19:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
